In [5]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm

In [6]:
df = pd.read_csv("C:/Users/AKSHATA KHEDEKAR/Downloads/LabTAT.csv")

In [7]:
df

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [8]:
df.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [9]:
df.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [10]:
Laboratory_1=df['Laboratory 1'].mean()

In [11]:
Laboratory_1

178.36158333333339

In [12]:
Laboratory_2=df['Laboratory 2'].mean()
Laboratory_3=df['Laboratory 3'].mean()
Laboratory_4=df['Laboratory 4'].mean()

In [13]:
print('Laboratory 2 Mean = ',Laboratory_2)
print('Laboratory 3 Mean = ',Laboratory_3)
print('Laboratory 4 Mean = ',Laboratory_4)

Laboratory 2 Mean =  178.9029166666668
Laboratory 3 Mean =  199.91325000000003
Laboratory 4 Mean =  163.6827499999999

In [15]:
#The Null and Alternative Hypothesis

#Null Hypo : There is no significant difference between the  mean Lab values. 
#H0:Î¼1=Î¼2=Î¼3=Î¼4=Î¼5

#Alternative Hypo :
#There is a significant difference between the  mean Lab values. 
#Ha:Î¼1â‰ Î¼2â‰ Î¼3â‰ Î¼4

In [16]:
alpha=0.05
Lab1=pd.DataFrame(df['Laboratory 1'])
Lab2=pd.DataFrame(df['Laboratory 2'])
Lab3=pd.DataFrame(df['Laboratory 3'])
Lab4=pd.DataFrame(df['Laboratory 4'])

In [17]:
Lab1,Lab1,Lab3,Lab4

(     Laboratory 1
 0          185.35
 1          170.49
 2          192.77
 3          177.33
 4          193.41
 ..            ...
 115        178.49
 116        176.08
 117        202.48
 118        182.40
 119        182.09

 [120 rows x 1 columns],
      Laboratory 1
 0          185.35
 1          170.49
 2          192.77
 3          177.33
 4          193.41
 ..            ...
 115        178.49
 116        176.08
 117        202.48
 118        182.40
 119        182.09

 [120 rows x 1 columns],
      Laboratory 3
 0          176.70
 1          198.45
 2          201.23
 3          199.61
 4          204.63
 ..            ...
 115        193.80
 116        215.25
 117        203.99
 118        194.52
 119        221.49

 [120 rows x 1 columns],
      Laboratory 4
 0          166.13
 1          160.79
 2          185.18
 3          176.42
 4          152.60
 ..            ...
 115        172.68
 116        177.64
 117        170.27
 118        150.87
 119        162.21

 [120 rows x 1 columns])

In [45]:
import scipy.stats as stats
import scipy

In [46]:
tStat, pvalue = scipy.stats.f_oneway(Lab1,Lab2,Lab3,Lab4)
print("P-Value:{0} T-Statistic:{1}".format(pvalue,tStat))

P-Value:[2.11567089e-57] T-Statistic:[118.70421654]

In [ ]:
#as p value is < 0.05
#we reject null hypothesis

In [ ]:
#Avg TAT are not Equal.

In [ ]:
#Conclusion : There is Difference in the average Turn Around Time (TAT) of reports